Revit 2027 API
KeyBasedTreeEntryTable.LoadFrom Method
 Loads KeyBasedTreeEntries from the specified external resource into this KeyBasedTreeEntryTable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceLoadStatus LoadFrom(
	ExternalResourceReference desiredResourceReference,
	KeyBasedTreeEntriesLoadResults loadResults
)
Public Function LoadFrom (
	desiredResourceReference As ExternalResourceReference,
	loadResults As KeyBasedTreeEntriesLoadResults
) As ExternalResourceLoadStatus
public:
ExternalResourceLoadStatus LoadFrom(
	ExternalResourceReference^ desiredResourceReference,
	KeyBasedTreeEntriesLoadResults^ loadResults
)
member LoadFrom :
        desiredResourceReference : ExternalResourceReference *
        loadResults : KeyBasedTreeEntriesLoadResults -> ExternalResourceLoadStatus
Parameters
desiredResourceReference ExternalResourceReference
 An external resource reference describing the source of the desired KeyBasedTreeEntry data.
loadResults KeyBasedTreeEntriesLoadResults
If provided, Revit will use this object to store any errors or warnings that were encountered.
 This argument may be null.
Return Value
ExternalResourceLoadStatus
 Returns whether the operation succeeded or failed.
Exceptions
Exception | Condition
ArgumentException |  The server referenced by the ExternalResourceReference does not exist or does not implement IExternalResourceServer. -or- The server referenced by the ExternalResourceReference cannot support the ExternalResourceReferenceType of this KeyBasedTreeEntryTable. -or- The ExternalResourceReference (desiredResourceReference) is not in a format that is supported by its server.
ArgumentNullException |  A non-optional argument was null
ModificationForbiddenException |  The document containing this KeyBasedTreeEntryTable is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document containing this KeyBasedTreeEntryTable is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document containing this KeyBasedTreeEntryTable has no open transaction.
See Also
Reference
KeyBasedTreeEntryTable Class
Autodesk.Revit.DB Namespace